In [2]:
import pandas as pd

In [4]:
#Creating first dataframe
prod=pd.DataFrame([[100,200,300,400,500],[4,2,5,8,6]],columns=['pen','shirt','book','mouse','cat'],index=['a','b'])
print("data frame of product is:\n",prod)

data frame of product is:
    pen  shirt  book  mouse  cat
a  100    200   300    400  500
b    4      2     5      8    6

In [5]:
print(prod.size)

10

In [6]:
#dimension of the dataframe
print(prod.shape)

(2, 5)

In [9]:
# returns column names
prod.keys()

Index(['pen', 'shirt', 'book', 'mouse', 'cat'], dtype='object')

In [7]:
#Creating first dataframe
prod2=pd.DataFrame([[100,200,300,400,500],[4,2,5,8,6]],columns=['pen','shirt','book','mouse','cat'],index=['c','d'])
prod2

   pen  shirt  book  mouse  cat
c  100    200   300    400  500
d    4      2     5      8    6

In [8]:
prod3=prod.append(prod2)
prod3

   pen  shirt  book  mouse  cat
a  100    200   300    400  500
b    4      2     5      8    6
c  100    200   300    400  500
d    4      2     5      8    6

In [10]:
a0=pd.concat([prod,prod2],axis=0)
a0

   pen  shirt  book  mouse  cat
a  100    200   300    400  500
b    4      2     5      8    6
c  100    200   300    400  500
d    4      2     5      8    6

In [11]:
a1=pd.concat([prod,prod2],axis=1)
a1

     pen  shirt   book  mouse    cat    pen  shirt   book  mouse    cat
a  100.0  200.0  300.0  400.0  500.0    NaN    NaN    NaN    NaN    NaN
b    4.0    2.0    5.0    8.0    6.0    NaN    NaN    NaN    NaN    NaN
c    NaN    NaN    NaN    NaN    NaN  100.0  200.0  300.0  400.0  500.0
d    NaN    NaN    NaN    NaN    NaN    4.0    2.0    5.0    8.0    6.0

In [9]:
values=[['Rohan',455],['Elvish',250],['Deepak',495],['Soni',400],['Radhika',350],['Vansh',450]]

df=pd.DataFrame(values,columns=['Name','Total Marks'])

df=df.assign(Percentage = lambda x: (x['Total Marks']/500 *100))
df

      Name  Total Marks  Percentage
0    Rohan          455        91.0
1   Elvish          250        50.0
2   Deepak          495        99.0
3     Soni          400        80.0
4  Radhika          350        70.0
5    Vansh          450        90.0